[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces > 2) {
-            this._faces = faces;
-        } else {
-            this._faces = 6;
-        }
-        this._last = 0;
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller Roller should have a specified number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces > 2) {
+        if (true) {
             this._faces = faces;
         } else {
killedBy: Roller Roller should default to 6 faces if less than 2 faces are specified
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] BlockStatement
src/Roller.ts:10:24
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces > 2) {
-            this._faces = faces;
-        } else {
+        if (faces > 2) {} else {
             this._faces = 6;
         }
killedBy: Roller Roller should have a specified number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:32:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if (value <= 1 || value > this._faces) {
-            return 0;
-        } else {
-            this._last = value;
-            this._distribution.set(value, this._distribution.get(value) + 1);
-            return value;
-        }
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller Roller should record a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:33:13
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if (value <= 1 || value > this._faces) {
+        if (value > 1 || value > this._faces) {
             return 0;
         } else {
killedBy: Roller Roller should record a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/Roller.ts:33:27
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if (value <= 1 || value > this._faces) {
+        if (value <= 1 || value <= this._faces) {
             return 0;
         } else {
killedBy: Roller Roller should record a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/Roller.ts:35:16
     roll(value: number): number{
         if (value <= 1 || value > this._faces) {
             return 0;
-        } else {
-            this._last = value;
-            this._distribution.set(value, this._distribution.get(value) + 1);
-            return value;
-        }
+        } else {}
     }
 
killedBy: Roller Roller should record a valid roll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined
